{"pages":[],"posts":[{"title":"思绪","text":"献给这个世界上最伟大的人此篇留白","link":"/2019/12/31/万千思绪/"},{"title":"思绪","text":"拿得起放得下","link":"/2020/01/03/拿得起放得下/"},{"title":"技术博客一","text":"关于建立博客Tips：（写在开头）作为一个微电子专业的工科生我并没有接受正规的计算机方面的知识教育所以以下所写都是个人自学所得可能有很多错误的认识和疏漏欢迎不吝赐教我相信能看下去的都是兴趣使然欢迎讨论探究 步入正题 首先说说我眼中的博客吧这个在当今时代或多或少有点落伍的东西却依旧以他独特的魅力广泛被用作技术和想法分享 现如今搭建博客最主流的要数WordPres了，就现如今的大型公司网站也有很多是基于这个架构搭建的，当然，他也属于开源的动态博客，WordPress作为全球最大的开源网站搭建平台，一直保持着极高的热度，，当然开源不意味着完全免费，想要搭建一个WordPress架构的博客，首先必须用到一台服务器，将自己的项目部署到这台服务器上，虽然说，完全可以将自己的电脑当做服务器，但是，这需要电脑做到24小时开机，显然这很不切实际，当然，不少人会想到用NAS来作为服务器，这一点我到没有具体试过，因为我没有自己搭过NAS，更没有尝试过在NAS上部署WordPress，不过，在和学校的一个创业老师聊天时，他有说自己尝试过NAS上搭建，不过遇到了问题，最终没有解决，最终还是选择了云服务器的方案虽然说WordPress搭建博客这项技术已经很泛滥，但是NAS上搭建还为数不多，有兴趣的可以尝试，也欢迎探讨。回到本题，继续说说WordPress搭站，简单地说他需要一台云服务器+一个域名，一个搭建，一个部署，操作起来倒是很简单，因为前辈们早就发明了宝塔面板这种神奇的东西，我在还不知道宝塔面板的时候尝试过自己手动敲代码搭建，那叫一个烦啊，虽然最终成功了，但是，经常出现问题，还会时不时地升级WordPress版本导致数据全部丢失，所以宝塔面板搭建WordPress网站简直是把饭送到了嘴边。上面说起来或许你感觉还不错，那我现在来算一算价格，域名+云服务器先说域名吧，本人倒是入手了两个域名，一个备案了，一个没有备案WordPress搭建博客应该是要备案的，成本方面，一个很随意的域名可能很便宜，我入手的两个都是.xyz结尾的，几十块钱。服务器嘛，国内用户大多会选择腾讯云和阿里云，他们学生是可以使用学生机的，我入手的是阿里云学生机，100多一年的样子，对学生还是很优惠的，非学生的话，一个一般配置的那就要1000+了国外就有很多了耳熟能详的谷歌云，搬瓦工，Vulter，很多很多，不少也有优惠他们的优点是可以用来部署科学上网，一机多用，还是值得入手的。 但是，对于我们这些学生来说，免费当然是最好的啦，有没有呢？答案是肯定的 先来卖个关子除了WordPress搭建博客之外，还可以用到静态博客框架举栗子啦HexoJekyllrbGohugoVurpress等等诸如此类他们都有点CMS的味道 而我要说的就是Hexo这个架构说到免费，当然少不了提一提Github这个大型同性交流平台啦作为全世界开源项目的根据地他一直勤勤勉勉，在被微软收购之后，他并没有改变它开源的本性可以说是十分良心啦Github实现免费的原因就在于他会给你提供一个和域名+CES发挥相同作用的github.io结尾的地址不仅可以将自己的东西存在上面，还可以让别人像域名那样访问，简直良心而这个免费的博客搭建方案就是才用的Hexo+Github框架使用Hexo，部署在Github上当然，如果对github.io结尾的域名没好感，他也是可以再转到别域名上面的其实之后的味道就和WordPress差不多了你可以切换主题啊（github上有很多开源的hexo主题，都是大神做的）写post博客啊，只不过，每次写完多要hexo d上传到github上博文采用常规的markdown格式他没有wordpress那样独立的管理后台因此没法做到随时随地发文，必须在部署的那台电脑上上传 说了这么多，都只是梗概写一篇博文可能会涉及具体的操作步骤有问题，欢迎讨论","link":"/2020/01/15/事项一/"},{"title":"网站规划","text":"谈一谈最近的想法最近有一种放空一切的感觉脑子里嘀咕了很多事情也有好多事情现在和过去产生了不同的看法依稀记得上次火车回家的时候那个时候发迷似的爱上了心理学，冥想和宗教从图书馆借出了仅有的G.E.B和少有人走的路两本书一顿乱翻不得不说，我的思考还是太肤浅了想不明白的太多 有亘古不变的，广为讨论的枪炮、病菌、钢铁就业、利息、货币当然，也有艺术与人工智能 世界纷繁复杂，好奇心这种东西会上瘾 我总觉得，自己沉迷在自己的圈子里太久了不能再闭关锁国了我需要表达我自己，需要展示我自己 这个想法在我的脑海中已经很久了我却始终没有做下去归根结底是懒 总觉得回顾过去所学是一件很没有意思的事情因为，你忘了很多，而且，你知道结果是什么样的你却需要重新去再走一遍那个过程 可能就像考研数学的证明题一样吧，为什么会有这种神奇的存在呢，得出了结论，用不就好了吗 但是还是得做啊这次打算用金钱逼迫自己去做弄完毕设之后，在学校百无聊赖剁手再次购买了云服务器 既然剁手了，总不能放那浪费吧毕竟，狗吃饭都知道舔干净我怎么能浪费money呢这么伤天害理的事一看就不是我的作风 这次的话，方向会有改变主要是往视频教程方向去做 噔噔蹬蹬，下一个何同学在此，手动滑稽 刚巧今天有同学问我博客是咋做的不如乘此机会，做一次教程，此外再分享分享一些好玩的黑科技 博客的话其实个人感觉作用还是很大的，一方面介绍自己，一方面又可以作为找工作的加分项毕竟电子简历这东西，做的人还不多肯定会让人眼前一亮的 具体说说吧，新的ECS还没有搭建博客呢那就当然要做一个新博客啦，开山之作，当然要写一篇序啦目前脑子里的想法是 写一篇致十年后的自己未来太多不确定，我得自己定位定位了 其次当然是做hexo架构的博客教程啦，这个简单方便，尤其是对于不打算购入域名的人来说，这简直是上乘之选真没想到github被谷歌收购之后，还能继续这么良心然后呢，我的打算是再出一个wordpress架构的的博客（网页）毕竟这才是主流吗，现在不少大型公司都是用的这个架构，不得不安利一波 有想过娱乐一点的素材想来想去决定做一个平板上玩云顶之弈的黑科技，虽然感觉，很多人都知道这个软件，但我觉得一般大家不会想到用来玩云顶的 再然后会有吉他自学打卡视频，不过这个很大程度上会鸽，毕竟前面的计划那么多我还想好好耍一耍呢 哎哎哎，视频视频突然有购入一台狗子或者大疆灵眸的冲动钱攒够了一定任性一波 想做的事还挺多，自认为自己还是很有灵感的万事开头难景智鹏，冲吧！！！","link":"/2020/01/12/2020寒假小规划/"},{"title":"网站规划","text":"谈一谈最近接触的东西和想法思绪万千，废柴第一次接触了云服务器ECS，也打算折腾一下云服务器，一开始纠结到底是装windows系统还是Linux，想到用windows的话可以挂一些游戏，刷刷东西之类的，但后来转念想想，那些都太没营养了，不如搞个Linux当学习用之后才有了这份规划 先说说系统吧作为一个学硬件(微电子)，系统啊，语言啊，我接触的并不多第一次接触Linux算是用cadence时，后来asic又用到了，对一些常规操作才有了了解考虑云服务器配置问题和稳定性问题，也为了进一步熟悉Linux，也为了折腾更多东西，最终我选择了Linux下的centos系统 说了这么多，开始罗列计划了1.有了云服务器，当然先倒腾一个网站啦，这次选择WordPress框架，之前选择的Hexo框架，虽然简单快捷，但是可自定义程度不高，尤其对于我这种非程序猿出生的，更是如此2.考虑了一下先后顺序，决定第二步是搭建自己的网盘，这样既可以享受高速的服务，又用的安心，也物尽其用3.经常看到以下好看的美图，忍不住收藏，准备建立一个图床，专门收集，算是珍珠配宝匣4.尝试搭一个游戏云服务器，饥荒自定义服务器网上的教程很多，准备练练手目前只有这么多思绪，先从这儿开始吧由于我的网站没有还备案，没法使用二级域名，所以wordpress的博客会放到新的域名上，以后再做调整新的域名 www.starriver.xyz 星河 嘿嘿，给自己取了个外号 星河君(手动滑稽)","link":"/2019/08/19/规划/"},{"title":"理想国","text":"模板第一标题 列表 列表2 a 子列表 b 子列表二 模板第二标题小标题 列表 列表2 a 子列表 b 子列表二","link":"/2019/05/02/理想国/"},{"title":"思绪","text":"所谓乌托邦##何其谓文明 高中便读过了反乌托邦三部曲在我内心，也时常会将乌托邦与共产主义化为一列当今中国的意识形态教育就和美丽新世界中的有所类似细细想来那样的文明也是幸福的人生来就是一个被不断洗脑的过程所谓快乐，幸福，爱情诸如此类都是慢慢沉淀的产物 人类就是这样前赴后继一代比一代伟大的 其实，并不觉得，如今是最美好的时代for one thing我们付出了太多追赶别人是一件辛苦的事情徐徐前行难道不是一件好事吗人类的存在都是一个谜难道人活着不应该是探索自己吗 北欧国家曾经批评过中国为什么这个国家敢发展得这么快他难打不为自己的人民着想吗他们难道不痛苦嘛 说的很对啊一味地devote，往往会造成内心空虚的场景这样倒不如乌托邦至少大家的内心是充实的阿尔法、贝塔、伽马、德尔塔和埃普斯隆各司其职这个世界进步了大家还很开心 跳出来吧，这些都也止于思考了或许唯物史观是对的 谈谈人类吧先从水谈起看起来平淡无奇的东西确实这个世界存在的原因 按理说，地球是不可能存在水的就地球的位置而言水金地火木土离太阳越近，行星应该都是岩石星球离太阳越远，就应该是气态的而谁哪来的呢？ 曾经有好多机构分析过水中含有两种不同的物质就类似于碳的有同素异形体这种而且这两种形态产生的条件都是不同的换句话说就以为止水并非地球之物那么或许人类也不是 水还有许多神奇的地方最先想到的便是雪花了精妙绝伦而且，世界上没有两片相同的雪花曾经有一个叫宾利的人（被誉为雪花男人）一生都在拍摄雪花他发现任何两片雪花总是不一样的 更匪夷所思的还有水变成冰的密度降低了听起来好像没什么作用但想象一下，生命是存在于水中的那么当类似于寒武纪这样的冰河期到来时水结成冰并不会沉下去还是会悬浮在水上面阳光依旧可以照射到下面的说中生命也得以延续 让人捉摸不透的太多甚至有说法谁才是人类最终的能源因为他可以反反复复我初中就曾设想过会不会有这么一个条件水中氢氧共价键断裂产生能量再放出水如此反反复复那岂不是人类太空旅行只要一桶水就足够了呢 这个假设并不是没有道理的As we know地球上存在过恐龙那么恐龙到底是怎么灭绝的呢陨石撞地球？那么陨石坑又在何处唯一的解释便是一个陨石砸到了海里触发了水爆炸（产生能量的机制）反反复复爆发出毁灭地球的爆炸这一点也可以从氢弹爆炸的蘑菇云和火山爆发的蘑菇云一样来解释 这一点也在人类未解之谜（终神之地，图拉遗迹）也有所显示在其中的石像中有石像手中拿着水枪一样的武器或许水本就是人类能源问题的最终解 匪夷所思的太多暂时先到这吧，下回再思考。","link":"/2020/01/01/闲得无聊/"},{"title":"钢铁侠","text":"随笔##漫谈复联4中的钢铁侠 -钢铁之心，难抉得失 唐尼的心事：“漫威系”即将迎来众超级英雄及反派的大婚，而最为苦恼的则是“钢铁侠”唐尼，因为当前至少有三对新人会相继举办婚礼（虽然有对外公布已举办婚礼的情况，但是举办多场小型婚礼派对在国外很常见），而后续档期非常紧缺的唐尼则可能面临抉择尬境，这究竟是什么原因呢？ 一、参加凤凰女的婚礼：理由：同宗族共血脉，超级英雄代表（索菲·特纳）：作为《权利的游戏》中，北境临冬城的史塔克一族，珊莎·史塔克（索菲·特纳饰）与漫威电影宇宙的钢铁侠托尼·史塔克同属史塔克家族，家族血脉从古至今延续至遥远的未来，因此作为同宗，唐尼也需要赏脸索菲·特纳的婚礼；虽然珊莎·史塔克曾被迫嫁给“小恶魔”提利昂·兰尼斯特，但是一日夫妻百日恩，而“小恶魔”（饰矮人王）在《复仇者联盟3》中起到了非常关键的作用，矮人王一方面为复仇者三巨头中的雷神打造了暴风战斧，另一方面虽然雷神没打败灭霸，但是钢铁侠托尼·史塔克还是一定程度上通过研究灭霸残旧的无限手套打造了属于复仇者联盟的专用无限手套，最终复活了所有人并且打败了另一时空的灭霸，因此钢铁侠也应该会给矮人王（小恶魔）的妻子一个面子；我们都知道当前漫威电影宇宙中最强的是惊奇队长，而索菲·特纳接下来在漫威的《X战警-黑凤凰》（由二十世纪福克斯公司出品）中饰演黑凤凰一角，而在漫威漫画故事中，黑凤凰又被称为“惊奇女孩”，一度强大到实力接近无限，可见其实力，而X战警的角色回归漫威电影宇宙也是影迷们呼喊声非常高的一件事，今后凤凰女与复仇者联盟的交际会更多，作为钢铁侠的唐尼还是要捧一下场的。 二、参加勇·罗格的婚礼：理由：出生入死相随，培养惊奇队长（裘德·洛）：福尔摩斯与华生是生死相交的好友，没有华生这样出色的队友，也就没有福尔摩斯这样的传奇故事，在真实工作中，裘德·洛作为第36届土星奖最佳男配角，在《大侦探福尔摩斯》中与唐尼配合献上了精彩的互动演出，为福尔摩斯的成功奠定了坚实的基础，并且唐尼在《复仇者联盟4》之后会出演《大侦探福尔摩斯》的续集，俩人还要继续搭档来破解疑案，虽然在《大侦探福尔摩斯》中，福尔摩斯是不希望好兄弟因为结婚受到约束的，但是在真实生活中，我们的唐尼是不是一定要参加和祝福我们的裘花呢？在漫威的《惊奇队长》中，裘德·洛饰演的勇·罗格曾是惊奇队长的教练（不称为导师是因为不具备导师的真心），如果没有勇·罗格便没有惊奇队长，没有了惊奇队长，宇宙魔方就不会在很长一段时间内受到噬元兽和神盾局的保护，《复仇者联盟4》中钢铁侠也不会在太空中获救，最终灭霸也不会因为钢铁侠的牺牲而被打败，因此我们的唐尼是不是要送去双重祝福给我们的裘花呢？ 二、参加星爵的婚礼：理由：迪士尼新巨星，复联四创造者（克里斯·帕拉特）：我们都知道，逆转无限的根本不是什么无限宝石，也不是什么皮姆粒子，真正逆转整个漫威电影宇宙的是“米老鼠”迪士尼，作为近年来迪士尼力捧的影星，克里斯·帕拉特每次都交出了优异的答卷，在《银河护卫队》以及《侏罗纪世界》两部系列的电影中都取得了超乎预计的票房收入，因此克里斯·帕拉特今后的星途一定是坦荡无疑的，并且现在的岳父是美国好莱坞所在地加州的前州长，况且还是能够随时穿越时空终结反派“终结者”，既然我们的星爵如此前途无量，迪士尼旗下的漫威电影宇宙领衔人物钢铁侠唐尼也值得参加我们星爵的婚礼吧？在《复仇者联盟3》中，因为发现“岳父”灭霸为了无限宝石牺牲了自己的挚爱，因此不顾队友们的缜密计划，将灭霸打醒，也造成了差点被小蜘蛛拿到手的无限手套被灭霸夺回，此后灭霸更是势如破竹地消灭了宇宙一半的生灵，最终才发生了《复仇者联盟4》的故事，因此讲星爵创造了《复仇者联盟4》也不为过，当然如果没有星爵，我们又怎么能再多看一次唐尼呢？ 大家觉得唐尼该怎么安排行程，又该分别为新人带去怎么样的祝福呢？","link":"/2019/06/13/钢铁侠/"},{"title":"推歌","text":"推一首歌##来自IG -Feelings are mutual Silhouettes Of You你的剪影I light the fuse是我 点燃了我们之间的导火索And I watch it burn看着纠纷燃起And somewhere deep inside, I know there’s a lesson to be learned在内心深处 我知道这是一个关于爱与痛的教训It’s not the crime but the way that we pay for这不是罪恶 但我们却要为此受尽折磨Feelings are mutual两情才能相悦And you go upstairs你漠然上楼 不再言语And I hang my head我呆在原地 思绪飘空Somebody said I let myself down as I crawled into bed有人说这一切都是我咎由自取的I wondered why the hell I’d ever paid for可是为什么要我尝遍这痛苦Feelings are mutual也许是因为 两情才能相悦I’m tired of living in the shadow我 厌倦了 沉溺在黑暗里的我These paper walls, I can’t break through但是那些伤痛如纸 密不透风I’m sick of standing by your window我 厌倦了 默默关注着你的我Tracing silhouettes of you厌倦了 挥之不去 你的一颦一笑But when it gets dark但是夜深人静You light the spark我又无法抑制地想起你And all the lies I try to live by start falling apart我的自欺欺人开始变得苍白无力Whoever knew it could be so painful从未想过 伤痛会如此折磨着我Feelings unmutual我体会到了你之前的痛苦Now I can’t escape无处可躲These things I’ve done它们正疯狂的侵蚀着我But my anxieties have promised me the worst is to come忧愁似乎告诉我这并不是最痛苦的So give up living for the life that you paid for所以不该为你而放弃生活Feelings are mutual一厢情愿 两情相悦I’ve won我输的一塌糊涂I’m tired of living in the shadow我 厌倦了 沉溺在黑暗里的我These paper walls, I can’t break through但是那些伤痛如纸 密不透风I’m sick of standing by your window我 厌倦了 默默关注着你的我Tracing silhouettes of you你明媚的眼眸Tracing silhouettes of you你微翘的嘴角I light the fuse是我 点燃了我们之间的导火索I watch it burn看着纠纷燃起And somewhere deep inside, I know there’s a lesson to be learned在内心深处 我知道这是一个关于爱与痛的教训It’s not the crime but the way that we pay这不是罪恶 但我们却要为此受尽折磨Feelings are mutual因为一厢情愿 两情才相悦","link":"/2019/06/13/闲来无事，推一首歌/"}],"tags":[{"name":"导航","slug":"导航","link":"/tags/导航/"},{"name":"分享","slug":"分享","link":"/tags/分享/"}],"categories":[]}