{"pages":[],"posts":[{"title":"理想国","text":"模板第一标题 列表 列表2 a 子列表 b 子列表二 模板第二标题小标题 列表 列表2 a 子列表 b 子列表二","link":"/2019/05/02/理想国/"},{"title":"钢铁侠","text":"随笔##漫谈复联4中的钢铁侠 -钢铁之心，难抉得失 唐尼的心事：“漫威系”即将迎来众超级英雄及反派的大婚，而最为苦恼的则是“钢铁侠”唐尼，因为当前至少有三对新人会相继举办婚礼（虽然有对外公布已举办婚礼的情况，但是举办多场小型婚礼派对在国外很常见），而后续档期非常紧缺的唐尼则可能面临抉择尬境，这究竟是什么原因呢？ 一、参加凤凰女的婚礼：理由：同宗族共血脉，超级英雄代表（索菲·特纳）：作为《权利的游戏》中，北境临冬城的史塔克一族，珊莎·史塔克（索菲·特纳饰）与漫威电影宇宙的钢铁侠托尼·史塔克同属史塔克家族，家族血脉从古至今延续至遥远的未来，因此作为同宗，唐尼也需要赏脸索菲·特纳的婚礼；虽然珊莎·史塔克曾被迫嫁给“小恶魔”提利昂·兰尼斯特，但是一日夫妻百日恩，而“小恶魔”（饰矮人王）在《复仇者联盟3》中起到了非常关键的作用，矮人王一方面为复仇者三巨头中的雷神打造了暴风战斧，另一方面虽然雷神没打败灭霸，但是钢铁侠托尼·史塔克还是一定程度上通过研究灭霸残旧的无限手套打造了属于复仇者联盟的专用无限手套，最终复活了所有人并且打败了另一时空的灭霸，因此钢铁侠也应该会给矮人王（小恶魔）的妻子一个面子；我们都知道当前漫威电影宇宙中最强的是惊奇队长，而索菲·特纳接下来在漫威的《X战警-黑凤凰》（由二十世纪福克斯公司出品）中饰演黑凤凰一角，而在漫威漫画故事中，黑凤凰又被称为“惊奇女孩”，一度强大到实力接近无限，可见其实力，而X战警的角色回归漫威电影宇宙也是影迷们呼喊声非常高的一件事，今后凤凰女与复仇者联盟的交际会更多，作为钢铁侠的唐尼还是要捧一下场的。 二、参加勇·罗格的婚礼：理由：出生入死相随，培养惊奇队长（裘德·洛）：福尔摩斯与华生是生死相交的好友，没有华生这样出色的队友，也就没有福尔摩斯这样的传奇故事，在真实工作中，裘德·洛作为第36届土星奖最佳男配角，在《大侦探福尔摩斯》中与唐尼配合献上了精彩的互动演出，为福尔摩斯的成功奠定了坚实的基础，并且唐尼在《复仇者联盟4》之后会出演《大侦探福尔摩斯》的续集，俩人还要继续搭档来破解疑案，虽然在《大侦探福尔摩斯》中，福尔摩斯是不希望好兄弟因为结婚受到约束的，但是在真实生活中，我们的唐尼是不是一定要参加和祝福我们的裘花呢？在漫威的《惊奇队长》中，裘德·洛饰演的勇·罗格曾是惊奇队长的教练（不称为导师是因为不具备导师的真心），如果没有勇·罗格便没有惊奇队长，没有了惊奇队长，宇宙魔方就不会在很长一段时间内受到噬元兽和神盾局的保护，《复仇者联盟4》中钢铁侠也不会在太空中获救，最终灭霸也不会因为钢铁侠的牺牲而被打败，因此我们的唐尼是不是要送去双重祝福给我们的裘花呢？ 二、参加星爵的婚礼：理由：迪士尼新巨星，复联四创造者（克里斯·帕拉特）：我们都知道，逆转无限的根本不是什么无限宝石，也不是什么皮姆粒子，真正逆转整个漫威电影宇宙的是“米老鼠”迪士尼，作为近年来迪士尼力捧的影星，克里斯·帕拉特每次都交出了优异的答卷，在《银河护卫队》以及《侏罗纪世界》两部系列的电影中都取得了超乎预计的票房收入，因此克里斯·帕拉特今后的星途一定是坦荡无疑的，并且现在的岳父是美国好莱坞所在地加州的前州长，况且还是能够随时穿越时空终结反派“终结者”，既然我们的星爵如此前途无量，迪士尼旗下的漫威电影宇宙领衔人物钢铁侠唐尼也值得参加我们星爵的婚礼吧？在《复仇者联盟3》中，因为发现“岳父”灭霸为了无限宝石牺牲了自己的挚爱，因此不顾队友们的缜密计划，将灭霸打醒，也造成了差点被小蜘蛛拿到手的无限手套被灭霸夺回，此后灭霸更是势如破竹地消灭了宇宙一半的生灵，最终才发生了《复仇者联盟4》的故事，因此讲星爵创造了《复仇者联盟4》也不为过，当然如果没有星爵，我们又怎么能再多看一次唐尼呢？ 大家觉得唐尼该怎么安排行程，又该分别为新人带去怎么样的祝福呢？","link":"/2019/06/13/钢铁侠/"},{"title":"推歌","text":"推一首歌##来自IG -Feelings are mutual Silhouettes Of You你的剪影I light the fuse是我 点燃了我们之间的导火索And I watch it burn看着纠纷燃起And somewhere deep inside, I know there’s a lesson to be learned在内心深处 我知道这是一个关于爱与痛的教训It’s not the crime but the way that we pay for这不是罪恶 但我们却要为此受尽折磨Feelings are mutual两情才能相悦And you go upstairs你漠然上楼 不再言语And I hang my head我呆在原地 思绪飘空Somebody said I let myself down as I crawled into bed有人说这一切都是我咎由自取的I wondered why the hell I’d ever paid for可是为什么要我尝遍这痛苦Feelings are mutual也许是因为 两情才能相悦I’m tired of living in the shadow我 厌倦了 沉溺在黑暗里的我These paper walls, I can’t break through但是那些伤痛如纸 密不透风I’m sick of standing by your window我 厌倦了 默默关注着你的我Tracing silhouettes of you厌倦了 挥之不去 你的一颦一笑But when it gets dark但是夜深人静You light the spark我又无法抑制地想起你And all the lies I try to live by start falling apart我的自欺欺人开始变得苍白无力Whoever knew it could be so painful从未想过 伤痛会如此折磨着我Feelings unmutual我体会到了你之前的痛苦Now I can’t escape无处可躲These things I’ve done它们正疯狂的侵蚀着我But my anxieties have promised me the worst is to come忧愁似乎告诉我这并不是最痛苦的So give up living for the life that you paid for所以不该为你而放弃生活Feelings are mutual一厢情愿 两情相悦I’ve won我输的一塌糊涂I’m tired of living in the shadow我 厌倦了 沉溺在黑暗里的我These paper walls, I can’t break through但是那些伤痛如纸 密不透风I’m sick of standing by your window我 厌倦了 默默关注着你的我Tracing silhouettes of you你明媚的眼眸Tracing silhouettes of you你微翘的嘴角I light the fuse是我 点燃了我们之间的导火索I watch it burn看着纠纷燃起And somewhere deep inside, I know there’s a lesson to be learned在内心深处 我知道这是一个关于爱与痛的教训It’s not the crime but the way that we pay这不是罪恶 但我们却要为此受尽折磨Feelings are mutual因为一厢情愿 两情才相悦","link":"/2019/06/13/闲来无事，推一首歌/"}],"tags":[{"name":"导航","slug":"导航","link":"/tags/导航/"},{"name":"分享","slug":"分享","link":"/tags/分享/"}],"categories":[]}